// Code generated by gen.sh; DO NOT EDIT.

pub type __u8 = ::core::ffi::c_uchar;
pub type __u16 = ::core::ffi::c_ushort;
pub type __s32 = ::core::ffi::c_int;
pub type __u32 = ::core::ffi::c_uint;
pub type __u64 = ::core::ffi::c_ulonglong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_generic_mapping {
    pub read: __u32,
    pub write: __u32,
    pub execute: __u32,
    pub all: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_generic_mapping"][::core::mem::size_of::<kacs_generic_mapping>() - 16usize];
    ["Alignment of kacs_generic_mapping"][::core::mem::align_of::<kacs_generic_mapping>() - 4usize];
    ["Offset of field: kacs_generic_mapping::read"]
        [::core::mem::offset_of!(kacs_generic_mapping, read) - 0usize];
    ["Offset of field: kacs_generic_mapping::write"]
        [::core::mem::offset_of!(kacs_generic_mapping, write) - 4usize];
    ["Offset of field: kacs_generic_mapping::execute"]
        [::core::mem::offset_of!(kacs_generic_mapping, execute) - 8usize];
    ["Offset of field: kacs_generic_mapping::all"]
        [::core::mem::offset_of!(kacs_generic_mapping, all) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_query_args {
    pub token_class: __u32,
    pub buf_len: __u32,
    pub buf_ptr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_query_args"][::core::mem::size_of::<kacs_query_args>() - 16usize];
    ["Alignment of kacs_query_args"][::core::mem::align_of::<kacs_query_args>() - 8usize];
    ["Offset of field: kacs_query_args::token_class"]
        [::core::mem::offset_of!(kacs_query_args, token_class) - 0usize];
    ["Offset of field: kacs_query_args::buf_len"]
        [::core::mem::offset_of!(kacs_query_args, buf_len) - 4usize];
    ["Offset of field: kacs_query_args::buf_ptr"]
        [::core::mem::offset_of!(kacs_query_args, buf_ptr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_adjust_privs_args {
    pub count: __u32,
    pub _pad: __u32,
    pub data_ptr: __u64,
    pub previous_enabled: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_adjust_privs_args"][::core::mem::size_of::<kacs_adjust_privs_args>() - 24usize];
    ["Alignment of kacs_adjust_privs_args"]
        [::core::mem::align_of::<kacs_adjust_privs_args>() - 8usize];
    ["Offset of field: kacs_adjust_privs_args::count"]
        [::core::mem::offset_of!(kacs_adjust_privs_args, count) - 0usize];
    ["Offset of field: kacs_adjust_privs_args::_pad"]
        [::core::mem::offset_of!(kacs_adjust_privs_args, _pad) - 4usize];
    ["Offset of field: kacs_adjust_privs_args::data_ptr"]
        [::core::mem::offset_of!(kacs_adjust_privs_args, data_ptr) - 8usize];
    ["Offset of field: kacs_adjust_privs_args::previous_enabled"]
        [::core::mem::offset_of!(kacs_adjust_privs_args, previous_enabled) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_priv_entry {
    pub luid: __u32,
    pub attributes: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_priv_entry"][::core::mem::size_of::<kacs_priv_entry>() - 8usize];
    ["Alignment of kacs_priv_entry"][::core::mem::align_of::<kacs_priv_entry>() - 4usize];
    ["Offset of field: kacs_priv_entry::luid"]
        [::core::mem::offset_of!(kacs_priv_entry, luid) - 0usize];
    ["Offset of field: kacs_priv_entry::attributes"]
        [::core::mem::offset_of!(kacs_priv_entry, attributes) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_adjust_groups_args {
    pub count: __u32,
    pub _pad: __u32,
    pub data_ptr: __u64,
    pub previous_state: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_adjust_groups_args"]
        [::core::mem::size_of::<kacs_adjust_groups_args>() - 24usize];
    ["Alignment of kacs_adjust_groups_args"]
        [::core::mem::align_of::<kacs_adjust_groups_args>() - 8usize];
    ["Offset of field: kacs_adjust_groups_args::count"]
        [::core::mem::offset_of!(kacs_adjust_groups_args, count) - 0usize];
    ["Offset of field: kacs_adjust_groups_args::_pad"]
        [::core::mem::offset_of!(kacs_adjust_groups_args, _pad) - 4usize];
    ["Offset of field: kacs_adjust_groups_args::data_ptr"]
        [::core::mem::offset_of!(kacs_adjust_groups_args, data_ptr) - 8usize];
    ["Offset of field: kacs_adjust_groups_args::previous_state"]
        [::core::mem::offset_of!(kacs_adjust_groups_args, previous_state) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_duplicate_args {
    pub access_mask: __u32,
    pub token_type: __u32,
    pub impersonation_level: __u32,
    pub result_fd: __s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_duplicate_args"][::core::mem::size_of::<kacs_duplicate_args>() - 16usize];
    ["Alignment of kacs_duplicate_args"][::core::mem::align_of::<kacs_duplicate_args>() - 4usize];
    ["Offset of field: kacs_duplicate_args::access_mask"]
        [::core::mem::offset_of!(kacs_duplicate_args, access_mask) - 0usize];
    ["Offset of field: kacs_duplicate_args::token_type"]
        [::core::mem::offset_of!(kacs_duplicate_args, token_type) - 4usize];
    ["Offset of field: kacs_duplicate_args::impersonation_level"]
        [::core::mem::offset_of!(kacs_duplicate_args, impersonation_level) - 8usize];
    ["Offset of field: kacs_duplicate_args::result_fd"]
        [::core::mem::offset_of!(kacs_duplicate_args, result_fd) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_group_entry {
    pub index: __u32,
    pub enable: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_group_entry"][::core::mem::size_of::<kacs_group_entry>() - 8usize];
    ["Alignment of kacs_group_entry"][::core::mem::align_of::<kacs_group_entry>() - 4usize];
    ["Offset of field: kacs_group_entry::index"]
        [::core::mem::offset_of!(kacs_group_entry, index) - 0usize];
    ["Offset of field: kacs_group_entry::enable"]
        [::core::mem::offset_of!(kacs_group_entry, enable) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_adjust_default_args {
    pub dacl_ptr: __u64,
    pub dacl_len: __u32,
    pub owner_index: __u16,
    pub group_index: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_adjust_default_args"]
        [::core::mem::size_of::<kacs_adjust_default_args>() - 16usize];
    ["Alignment of kacs_adjust_default_args"]
        [::core::mem::align_of::<kacs_adjust_default_args>() - 8usize];
    ["Offset of field: kacs_adjust_default_args::dacl_ptr"]
        [::core::mem::offset_of!(kacs_adjust_default_args, dacl_ptr) - 0usize];
    ["Offset of field: kacs_adjust_default_args::dacl_len"]
        [::core::mem::offset_of!(kacs_adjust_default_args, dacl_len) - 8usize];
    ["Offset of field: kacs_adjust_default_args::owner_index"]
        [::core::mem::offset_of!(kacs_adjust_default_args, owner_index) - 12usize];
    ["Offset of field: kacs_adjust_default_args::group_index"]
        [::core::mem::offset_of!(kacs_adjust_default_args, group_index) - 14usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_restrict_args {
    pub privs_to_delete: __u64,
    pub num_deny_indices: __u32,
    pub num_restrict_sids: __u32,
    pub data_len: __u32,
    pub flags: __u32,
    pub data_ptr: __u64,
    pub result_fd: __s32,
    pub _pad: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_restrict_args"][::core::mem::size_of::<kacs_restrict_args>() - 40usize];
    ["Alignment of kacs_restrict_args"][::core::mem::align_of::<kacs_restrict_args>() - 8usize];
    ["Offset of field: kacs_restrict_args::privs_to_delete"]
        [::core::mem::offset_of!(kacs_restrict_args, privs_to_delete) - 0usize];
    ["Offset of field: kacs_restrict_args::num_deny_indices"]
        [::core::mem::offset_of!(kacs_restrict_args, num_deny_indices) - 8usize];
    ["Offset of field: kacs_restrict_args::num_restrict_sids"]
        [::core::mem::offset_of!(kacs_restrict_args, num_restrict_sids) - 12usize];
    ["Offset of field: kacs_restrict_args::data_len"]
        [::core::mem::offset_of!(kacs_restrict_args, data_len) - 16usize];
    ["Offset of field: kacs_restrict_args::flags"]
        [::core::mem::offset_of!(kacs_restrict_args, flags) - 20usize];
    ["Offset of field: kacs_restrict_args::data_ptr"]
        [::core::mem::offset_of!(kacs_restrict_args, data_ptr) - 24usize];
    ["Offset of field: kacs_restrict_args::result_fd"]
        [::core::mem::offset_of!(kacs_restrict_args, result_fd) - 32usize];
    ["Offset of field: kacs_restrict_args::_pad"]
        [::core::mem::offset_of!(kacs_restrict_args, _pad) - 36usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_link_tokens_args {
    pub elevated_fd: __s32,
    pub filtered_fd: __s32,
    pub session_id: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_link_tokens_args"][::core::mem::size_of::<kacs_link_tokens_args>() - 16usize];
    ["Alignment of kacs_link_tokens_args"]
        [::core::mem::align_of::<kacs_link_tokens_args>() - 8usize];
    ["Offset of field: kacs_link_tokens_args::elevated_fd"]
        [::core::mem::offset_of!(kacs_link_tokens_args, elevated_fd) - 0usize];
    ["Offset of field: kacs_link_tokens_args::filtered_fd"]
        [::core::mem::offset_of!(kacs_link_tokens_args, filtered_fd) - 4usize];
    ["Offset of field: kacs_link_tokens_args::session_id"]
        [::core::mem::offset_of!(kacs_link_tokens_args, session_id) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_get_linked_token_args {
    pub result_fd: __s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_get_linked_token_args"]
        [::core::mem::size_of::<kacs_get_linked_token_args>() - 4usize];
    ["Alignment of kacs_get_linked_token_args"]
        [::core::mem::align_of::<kacs_get_linked_token_args>() - 4usize];
    ["Offset of field: kacs_get_linked_token_args::result_fd"]
        [::core::mem::offset_of!(kacs_get_linked_token_args, result_fd) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_access_check_args {
    pub caller_size: __u32,
    pub token_fd: __s32,
    pub sd_ptr: __u64,
    pub sd_len: __u32,
    pub desired_access: __u32,
    pub mapping_read: __u32,
    pub mapping_write: __u32,
    pub mapping_execute: __u32,
    pub mapping_all: __u32,
    pub self_sid_ptr: __u64,
    pub self_sid_len: __u32,
    pub privilege_intent: __u32,
    pub object_tree_ptr: __u64,
    pub object_tree_count: __u32,
    pub _pad0: __u32,
    pub local_claims_ptr: __u64,
    pub local_claims_len: __u32,
    pub _pad1: __u32,
    pub granted_out_ptr: __u64,
    pub pip_type: __u32,
    pub pip_trust: __u32,
    pub audit_context_ptr: __u64,
    pub audit_context_len: __u32,
    pub _pad2: __u32,
    pub continuous_audit_out_ptr: __u64,
    pub staging_mismatch_out_ptr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_access_check_args"][::core::mem::size_of::<kacs_access_check_args>() - 136usize];
    ["Alignment of kacs_access_check_args"]
        [::core::mem::align_of::<kacs_access_check_args>() - 8usize];
    ["Offset of field: kacs_access_check_args::caller_size"]
        [::core::mem::offset_of!(kacs_access_check_args, caller_size) - 0usize];
    ["Offset of field: kacs_access_check_args::token_fd"]
        [::core::mem::offset_of!(kacs_access_check_args, token_fd) - 4usize];
    ["Offset of field: kacs_access_check_args::sd_ptr"]
        [::core::mem::offset_of!(kacs_access_check_args, sd_ptr) - 8usize];
    ["Offset of field: kacs_access_check_args::sd_len"]
        [::core::mem::offset_of!(kacs_access_check_args, sd_len) - 16usize];
    ["Offset of field: kacs_access_check_args::desired_access"]
        [::core::mem::offset_of!(kacs_access_check_args, desired_access) - 20usize];
    ["Offset of field: kacs_access_check_args::mapping_read"]
        [::core::mem::offset_of!(kacs_access_check_args, mapping_read) - 24usize];
    ["Offset of field: kacs_access_check_args::mapping_write"]
        [::core::mem::offset_of!(kacs_access_check_args, mapping_write) - 28usize];
    ["Offset of field: kacs_access_check_args::mapping_execute"]
        [::core::mem::offset_of!(kacs_access_check_args, mapping_execute) - 32usize];
    ["Offset of field: kacs_access_check_args::mapping_all"]
        [::core::mem::offset_of!(kacs_access_check_args, mapping_all) - 36usize];
    ["Offset of field: kacs_access_check_args::self_sid_ptr"]
        [::core::mem::offset_of!(kacs_access_check_args, self_sid_ptr) - 40usize];
    ["Offset of field: kacs_access_check_args::self_sid_len"]
        [::core::mem::offset_of!(kacs_access_check_args, self_sid_len) - 48usize];
    ["Offset of field: kacs_access_check_args::privilege_intent"]
        [::core::mem::offset_of!(kacs_access_check_args, privilege_intent) - 52usize];
    ["Offset of field: kacs_access_check_args::object_tree_ptr"]
        [::core::mem::offset_of!(kacs_access_check_args, object_tree_ptr) - 56usize];
    ["Offset of field: kacs_access_check_args::object_tree_count"]
        [::core::mem::offset_of!(kacs_access_check_args, object_tree_count) - 64usize];
    ["Offset of field: kacs_access_check_args::_pad0"]
        [::core::mem::offset_of!(kacs_access_check_args, _pad0) - 68usize];
    ["Offset of field: kacs_access_check_args::local_claims_ptr"]
        [::core::mem::offset_of!(kacs_access_check_args, local_claims_ptr) - 72usize];
    ["Offset of field: kacs_access_check_args::local_claims_len"]
        [::core::mem::offset_of!(kacs_access_check_args, local_claims_len) - 80usize];
    ["Offset of field: kacs_access_check_args::_pad1"]
        [::core::mem::offset_of!(kacs_access_check_args, _pad1) - 84usize];
    ["Offset of field: kacs_access_check_args::granted_out_ptr"]
        [::core::mem::offset_of!(kacs_access_check_args, granted_out_ptr) - 88usize];
    ["Offset of field: kacs_access_check_args::pip_type"]
        [::core::mem::offset_of!(kacs_access_check_args, pip_type) - 96usize];
    ["Offset of field: kacs_access_check_args::pip_trust"]
        [::core::mem::offset_of!(kacs_access_check_args, pip_trust) - 100usize];
    ["Offset of field: kacs_access_check_args::audit_context_ptr"]
        [::core::mem::offset_of!(kacs_access_check_args, audit_context_ptr) - 104usize];
    ["Offset of field: kacs_access_check_args::audit_context_len"]
        [::core::mem::offset_of!(kacs_access_check_args, audit_context_len) - 112usize];
    ["Offset of field: kacs_access_check_args::_pad2"]
        [::core::mem::offset_of!(kacs_access_check_args, _pad2) - 116usize];
    ["Offset of field: kacs_access_check_args::continuous_audit_out_ptr"]
        [::core::mem::offset_of!(kacs_access_check_args, continuous_audit_out_ptr) - 120usize];
    ["Offset of field: kacs_access_check_args::staging_mismatch_out_ptr"]
        [::core::mem::offset_of!(kacs_access_check_args, staging_mismatch_out_ptr) - 128usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_object_type_entry {
    pub level: __u16,
    pub _reserved: __u16,
    pub guid: [__u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_object_type_entry"][::core::mem::size_of::<kacs_object_type_entry>() - 20usize];
    ["Alignment of kacs_object_type_entry"]
        [::core::mem::align_of::<kacs_object_type_entry>() - 2usize];
    ["Offset of field: kacs_object_type_entry::level"]
        [::core::mem::offset_of!(kacs_object_type_entry, level) - 0usize];
    ["Offset of field: kacs_object_type_entry::_reserved"]
        [::core::mem::offset_of!(kacs_object_type_entry, _reserved) - 2usize];
    ["Offset of field: kacs_object_type_entry::guid"]
        [::core::mem::offset_of!(kacs_object_type_entry, guid) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_node_result {
    pub granted: __u32,
    pub status: __s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_node_result"][::core::mem::size_of::<kacs_node_result>() - 8usize];
    ["Alignment of kacs_node_result"][::core::mem::align_of::<kacs_node_result>() - 4usize];
    ["Offset of field: kacs_node_result::granted"]
        [::core::mem::offset_of!(kacs_node_result, granted) - 0usize];
    ["Offset of field: kacs_node_result::status"]
        [::core::mem::offset_of!(kacs_node_result, status) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_open_how {
    pub desired_access: __u32,
    pub create_disposition: __u32,
    pub create_options: __u32,
    pub flags: __u32,
    pub sd_ptr: __u64,
    pub sd_len: __u32,
    pub __pad: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_open_how"][::core::mem::size_of::<kacs_open_how>() - 32usize];
    ["Alignment of kacs_open_how"][::core::mem::align_of::<kacs_open_how>() - 8usize];
    ["Offset of field: kacs_open_how::desired_access"]
        [::core::mem::offset_of!(kacs_open_how, desired_access) - 0usize];
    ["Offset of field: kacs_open_how::create_disposition"]
        [::core::mem::offset_of!(kacs_open_how, create_disposition) - 4usize];
    ["Offset of field: kacs_open_how::create_options"]
        [::core::mem::offset_of!(kacs_open_how, create_options) - 8usize];
    ["Offset of field: kacs_open_how::flags"]
        [::core::mem::offset_of!(kacs_open_how, flags) - 12usize];
    ["Offset of field: kacs_open_how::sd_ptr"]
        [::core::mem::offset_of!(kacs_open_how, sd_ptr) - 16usize];
    ["Offset of field: kacs_open_how::sd_len"]
        [::core::mem::offset_of!(kacs_open_how, sd_len) - 24usize];
    ["Offset of field: kacs_open_how::__pad"]
        [::core::mem::offset_of!(kacs_open_how, __pad) - 28usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_mount_policy_args {
    pub policy: __u32,
    pub flags: __u32,
    pub generation: __u32,
    pub __pad0: __u32,
    pub template_sd_ptr: __u64,
    pub template_sd_len: __u32,
    pub __pad1: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kacs_mount_policy_args"][::core::mem::size_of::<kacs_mount_policy_args>() - 32usize];
    ["Alignment of kacs_mount_policy_args"]
        [::core::mem::align_of::<kacs_mount_policy_args>() - 8usize];
    ["Offset of field: kacs_mount_policy_args::policy"]
        [::core::mem::offset_of!(kacs_mount_policy_args, policy) - 0usize];
    ["Offset of field: kacs_mount_policy_args::flags"]
        [::core::mem::offset_of!(kacs_mount_policy_args, flags) - 4usize];
    ["Offset of field: kacs_mount_policy_args::generation"]
        [::core::mem::offset_of!(kacs_mount_policy_args, generation) - 8usize];
    ["Offset of field: kacs_mount_policy_args::__pad0"]
        [::core::mem::offset_of!(kacs_mount_policy_args, __pad0) - 12usize];
    ["Offset of field: kacs_mount_policy_args::template_sd_ptr"]
        [::core::mem::offset_of!(kacs_mount_policy_args, template_sd_ptr) - 16usize];
    ["Offset of field: kacs_mount_policy_args::template_sd_len"]
        [::core::mem::offset_of!(kacs_mount_policy_args, template_sd_len) - 24usize];
    ["Offset of field: kacs_mount_policy_args::__pad1"]
        [::core::mem::offset_of!(kacs_mount_policy_args, __pad1) - 28usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kmes_emit_entry {
    pub event_type: __u64,
    pub event_type_len: __u16,
    pub _pad0: [__u8; 6usize],
    pub payload: __u64,
    pub payload_len: __u32,
    pub _pad1: [__u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kmes_emit_entry"][::core::mem::size_of::<kmes_emit_entry>() - 32usize];
    ["Alignment of kmes_emit_entry"][::core::mem::align_of::<kmes_emit_entry>() - 8usize];
    ["Offset of field: kmes_emit_entry::event_type"]
        [::core::mem::offset_of!(kmes_emit_entry, event_type) - 0usize];
    ["Offset of field: kmes_emit_entry::event_type_len"]
        [::core::mem::offset_of!(kmes_emit_entry, event_type_len) - 8usize];
    ["Offset of field: kmes_emit_entry::_pad0"]
        [::core::mem::offset_of!(kmes_emit_entry, _pad0) - 10usize];
    ["Offset of field: kmes_emit_entry::payload"]
        [::core::mem::offset_of!(kmes_emit_entry, payload) - 16usize];
    ["Offset of field: kmes_emit_entry::payload_len"]
        [::core::mem::offset_of!(kmes_emit_entry, payload_len) - 24usize];
    ["Offset of field: kmes_emit_entry::_pad1"]
        [::core::mem::offset_of!(kmes_emit_entry, _pad1) - 28usize];
};
