// Code generated by gen.sh; DO NOT EDIT.

pub type __u8 = ::core::ffi::c_uchar;
pub type __u16 = ::core::ffi::c_ushort;
pub type __s32 = ::core::ffi::c_int;
pub type __u32 = ::core::ffi::c_uint;
pub type __u64 = ::core::ffi::c_ulonglong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_generic_mapping {
    pub read: __u32,
    pub write: __u32,
    pub execute: __u32,
    pub all: __u32,
}
#[test]
fn bindgen_test_layout_kacs_generic_mapping() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_generic_mapping> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_generic_mapping>(),
        16usize,
        concat!("Size of: ", stringify!(kacs_generic_mapping))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_generic_mapping>(),
        4usize,
        concat!("Alignment of ", stringify!(kacs_generic_mapping))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).read) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_generic_mapping),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_generic_mapping),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).execute) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_generic_mapping),
            "::",
            stringify!(execute)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).all) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_generic_mapping),
            "::",
            stringify!(all)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_query_args {
    pub token_class: __u32,
    pub buf_len: __u32,
    pub buf_ptr: __u64,
}
#[test]
fn bindgen_test_layout_kacs_query_args() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_query_args> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_query_args>(),
        16usize,
        concat!("Size of: ", stringify!(kacs_query_args))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_query_args>(),
        8usize,
        concat!("Alignment of ", stringify!(kacs_query_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).token_class) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_query_args),
            "::",
            stringify!(token_class)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buf_len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_query_args),
            "::",
            stringify!(buf_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buf_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_query_args),
            "::",
            stringify!(buf_ptr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_adjust_privs_args {
    pub count: __u32,
    pub _pad: __u32,
    pub data_ptr: __u64,
    pub previous_enabled: __u64,
}
#[test]
fn bindgen_test_layout_kacs_adjust_privs_args() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_adjust_privs_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_adjust_privs_args>(),
        24usize,
        concat!("Size of: ", stringify!(kacs_adjust_privs_args))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_adjust_privs_args>(),
        8usize,
        concat!("Alignment of ", stringify!(kacs_adjust_privs_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_adjust_privs_args),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_adjust_privs_args),
            "::",
            stringify!(_pad)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_adjust_privs_args),
            "::",
            stringify!(data_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).previous_enabled) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_adjust_privs_args),
            "::",
            stringify!(previous_enabled)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_priv_entry {
    pub luid: __u32,
    pub attributes: __u32,
}
#[test]
fn bindgen_test_layout_kacs_priv_entry() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_priv_entry> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_priv_entry>(),
        8usize,
        concat!("Size of: ", stringify!(kacs_priv_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_priv_entry>(),
        4usize,
        concat!("Alignment of ", stringify!(kacs_priv_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).luid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_priv_entry),
            "::",
            stringify!(luid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).attributes) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_priv_entry),
            "::",
            stringify!(attributes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_adjust_groups_args {
    pub count: __u32,
    pub _pad: __u32,
    pub data_ptr: __u64,
    pub previous_state: [__u64; 16usize],
}
#[test]
fn bindgen_test_layout_kacs_adjust_groups_args() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_adjust_groups_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_adjust_groups_args>(),
        144usize,
        concat!("Size of: ", stringify!(kacs_adjust_groups_args))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_adjust_groups_args>(),
        8usize,
        concat!("Alignment of ", stringify!(kacs_adjust_groups_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_adjust_groups_args),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_adjust_groups_args),
            "::",
            stringify!(_pad)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_adjust_groups_args),
            "::",
            stringify!(data_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).previous_state) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_adjust_groups_args),
            "::",
            stringify!(previous_state)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_duplicate_args {
    pub access_mask: __u32,
    pub token_type: __u32,
    pub impersonation_level: __u32,
    pub result_fd: __s32,
}
#[test]
fn bindgen_test_layout_kacs_duplicate_args() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_duplicate_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_duplicate_args>(),
        16usize,
        concat!("Size of: ", stringify!(kacs_duplicate_args))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_duplicate_args>(),
        4usize,
        concat!("Alignment of ", stringify!(kacs_duplicate_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).access_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_duplicate_args),
            "::",
            stringify!(access_mask)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).token_type) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_duplicate_args),
            "::",
            stringify!(token_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).impersonation_level) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_duplicate_args),
            "::",
            stringify!(impersonation_level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_fd) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_duplicate_args),
            "::",
            stringify!(result_fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_group_entry {
    pub index: __u32,
    pub enable: __u32,
}
#[test]
fn bindgen_test_layout_kacs_group_entry() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_group_entry> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_group_entry>(),
        8usize,
        concat!("Size of: ", stringify!(kacs_group_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_group_entry>(),
        4usize,
        concat!("Alignment of ", stringify!(kacs_group_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_group_entry),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_group_entry),
            "::",
            stringify!(enable)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_adjust_default_args {
    pub dacl_ptr: __u64,
    pub dacl_len: __u32,
    pub owner_index: __u16,
    pub group_index: __u16,
}
#[test]
fn bindgen_test_layout_kacs_adjust_default_args() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_adjust_default_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_adjust_default_args>(),
        16usize,
        concat!("Size of: ", stringify!(kacs_adjust_default_args))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_adjust_default_args>(),
        8usize,
        concat!("Alignment of ", stringify!(kacs_adjust_default_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dacl_ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_adjust_default_args),
            "::",
            stringify!(dacl_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dacl_len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_adjust_default_args),
            "::",
            stringify!(dacl_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).owner_index) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_adjust_default_args),
            "::",
            stringify!(owner_index)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).group_index) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_adjust_default_args),
            "::",
            stringify!(group_index)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_restrict_args {
    pub privs_to_delete: __u64,
    pub num_deny_indices: __u32,
    pub num_restrict_sids: __u32,
    pub data_len: __u32,
    pub flags: __u32,
    pub data_ptr: __u64,
    pub result_fd: __s32,
    pub _pad: __u32,
}
#[test]
fn bindgen_test_layout_kacs_restrict_args() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_restrict_args> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_restrict_args>(),
        40usize,
        concat!("Size of: ", stringify!(kacs_restrict_args))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_restrict_args>(),
        8usize,
        concat!("Alignment of ", stringify!(kacs_restrict_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).privs_to_delete) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_restrict_args),
            "::",
            stringify!(privs_to_delete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_deny_indices) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_restrict_args),
            "::",
            stringify!(num_deny_indices)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).num_restrict_sids) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_restrict_args),
            "::",
            stringify!(num_restrict_sids)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_restrict_args),
            "::",
            stringify!(data_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_restrict_args),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_ptr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_restrict_args),
            "::",
            stringify!(data_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_fd) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_restrict_args),
            "::",
            stringify!(result_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_restrict_args),
            "::",
            stringify!(_pad)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_link_tokens_args {
    pub elevated_fd: __s32,
    pub filtered_fd: __s32,
    pub session_id: __u64,
}
#[test]
fn bindgen_test_layout_kacs_link_tokens_args() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_link_tokens_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_link_tokens_args>(),
        16usize,
        concat!("Size of: ", stringify!(kacs_link_tokens_args))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_link_tokens_args>(),
        8usize,
        concat!("Alignment of ", stringify!(kacs_link_tokens_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).elevated_fd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_link_tokens_args),
            "::",
            stringify!(elevated_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).filtered_fd) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_link_tokens_args),
            "::",
            stringify!(filtered_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).session_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_link_tokens_args),
            "::",
            stringify!(session_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_get_linked_token_args {
    pub result_fd: __s32,
}
#[test]
fn bindgen_test_layout_kacs_get_linked_token_args() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_get_linked_token_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_get_linked_token_args>(),
        4usize,
        concat!("Size of: ", stringify!(kacs_get_linked_token_args))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_get_linked_token_args>(),
        4usize,
        concat!("Alignment of ", stringify!(kacs_get_linked_token_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_fd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_get_linked_token_args),
            "::",
            stringify!(result_fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_access_check_args {
    pub caller_size: __u32,
    pub token_fd: __s32,
    pub sd_ptr: __u64,
    pub sd_len: __u32,
    pub desired_access: __u32,
    pub mapping_read: __u32,
    pub mapping_write: __u32,
    pub mapping_execute: __u32,
    pub mapping_all: __u32,
    pub self_sid_ptr: __u64,
    pub self_sid_len: __u32,
    pub privilege_intent: __u32,
    pub object_tree_ptr: __u64,
    pub object_tree_count: __u32,
    pub _pad0: __u32,
    pub local_claims_ptr: __u64,
    pub local_claims_len: __u32,
    pub _pad1: __u32,
    pub granted_out_ptr: __u64,
    pub pip_type: __u32,
    pub pip_trust: __u32,
    pub audit_context_ptr: __u64,
    pub audit_context_len: __u32,
    pub _pad2: __u32,
    pub continuous_audit_out_ptr: __u64,
    pub staging_mismatch_out_ptr: __u64,
}
#[test]
fn bindgen_test_layout_kacs_access_check_args() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_access_check_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_access_check_args>(),
        136usize,
        concat!("Size of: ", stringify!(kacs_access_check_args))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_access_check_args>(),
        8usize,
        concat!("Alignment of ", stringify!(kacs_access_check_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).caller_size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(caller_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).token_fd) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(token_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sd_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(sd_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sd_len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(sd_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).desired_access) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(desired_access)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mapping_read) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(mapping_read)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mapping_write) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(mapping_write)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mapping_execute) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(mapping_execute)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mapping_all) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(mapping_all)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).self_sid_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(self_sid_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).self_sid_len) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(self_sid_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).privilege_intent) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(privilege_intent)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).object_tree_ptr) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(object_tree_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).object_tree_count) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(object_tree_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad0) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).local_claims_ptr) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(local_claims_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).local_claims_len) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(local_claims_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad1) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(_pad1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).granted_out_ptr) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(granted_out_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pip_type) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(pip_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pip_trust) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(pip_trust)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).audit_context_ptr) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(audit_context_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).audit_context_len) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(audit_context_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(_pad2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).continuous_audit_out_ptr) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(continuous_audit_out_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).staging_mismatch_out_ptr) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_access_check_args),
            "::",
            stringify!(staging_mismatch_out_ptr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_object_type_entry {
    pub level: __u16,
    pub _reserved: __u16,
    pub guid: [__u8; 16usize],
}
#[test]
fn bindgen_test_layout_kacs_object_type_entry() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_object_type_entry> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_object_type_entry>(),
        20usize,
        concat!("Size of: ", stringify!(kacs_object_type_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_object_type_entry>(),
        2usize,
        concat!("Alignment of ", stringify!(kacs_object_type_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_object_type_entry),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._reserved) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_object_type_entry),
            "::",
            stringify!(_reserved)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).guid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_object_type_entry),
            "::",
            stringify!(guid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_node_result {
    pub granted: __u32,
    pub status: __s32,
}
#[test]
fn bindgen_test_layout_kacs_node_result() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_node_result> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_node_result>(),
        8usize,
        concat!("Size of: ", stringify!(kacs_node_result))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_node_result>(),
        4usize,
        concat!("Alignment of ", stringify!(kacs_node_result))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).granted) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_node_result),
            "::",
            stringify!(granted)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_node_result),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_open_how {
    pub desired_access: __u32,
    pub create_disposition: __u32,
    pub create_options: __u32,
    pub flags: __u32,
    pub sd_ptr: __u64,
    pub sd_len: __u32,
    pub __pad: __u32,
}
#[test]
fn bindgen_test_layout_kacs_open_how() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_open_how> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_open_how>(),
        32usize,
        concat!("Size of: ", stringify!(kacs_open_how))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_open_how>(),
        8usize,
        concat!("Alignment of ", stringify!(kacs_open_how))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).desired_access) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_open_how),
            "::",
            stringify!(desired_access)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_disposition) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_open_how),
            "::",
            stringify!(create_disposition)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_options) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_open_how),
            "::",
            stringify!(create_options)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_open_how),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sd_ptr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_open_how),
            "::",
            stringify!(sd_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sd_len) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_open_how),
            "::",
            stringify!(sd_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pad) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_open_how),
            "::",
            stringify!(__pad)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kacs_mount_policy_args {
    pub policy: __u32,
    pub flags: __u32,
    pub generation: __u32,
    pub __pad0: __u32,
    pub template_sd_ptr: __u64,
    pub template_sd_len: __u32,
    pub __pad1: __u32,
}
#[test]
fn bindgen_test_layout_kacs_mount_policy_args() {
    const UNINIT: ::core::mem::MaybeUninit<kacs_mount_policy_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kacs_mount_policy_args>(),
        32usize,
        concat!("Size of: ", stringify!(kacs_mount_policy_args))
    );
    assert_eq!(
        ::core::mem::align_of::<kacs_mount_policy_args>(),
        8usize,
        concat!("Alignment of ", stringify!(kacs_mount_policy_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).policy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_mount_policy_args),
            "::",
            stringify!(policy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_mount_policy_args),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).generation) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_mount_policy_args),
            "::",
            stringify!(generation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pad0) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_mount_policy_args),
            "::",
            stringify!(__pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).template_sd_ptr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_mount_policy_args),
            "::",
            stringify!(template_sd_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).template_sd_len) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_mount_policy_args),
            "::",
            stringify!(template_sd_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(kacs_mount_policy_args),
            "::",
            stringify!(__pad1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kmes_emit_entry {
    pub event_type: __u64,
    pub event_type_len: __u16,
    pub _pad0: [__u8; 6usize],
    pub payload: __u64,
    pub payload_len: __u32,
    pub _pad1: [__u8; 4usize],
}
#[test]
fn bindgen_test_layout_kmes_emit_entry() {
    const UNINIT: ::core::mem::MaybeUninit<kmes_emit_entry> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<kmes_emit_entry>(),
        32usize,
        concat!("Size of: ", stringify!(kmes_emit_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<kmes_emit_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(kmes_emit_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(kmes_emit_entry),
            "::",
            stringify!(event_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_type_len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(kmes_emit_entry),
            "::",
            stringify!(event_type_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad0) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(kmes_emit_entry),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).payload) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(kmes_emit_entry),
            "::",
            stringify!(payload)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).payload_len) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(kmes_emit_entry),
            "::",
            stringify!(payload_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad1) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(kmes_emit_entry),
            "::",
            stringify!(_pad1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_create_key_args {
    pub parent_fd: __s32,
    pub _pad0: __u32,
    pub path_ptr: __u64,
    pub desired_access: __u32,
    pub flags: __u32,
    pub layer_ptr: __u64,
    pub txn_fd: __s32,
    pub _pad1: __u32,
    pub disposition_ptr: __u64,
}
#[test]
fn bindgen_test_layout_reg_create_key_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_create_key_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_create_key_args>(),
        48usize,
        concat!("Size of: ", stringify!(reg_create_key_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_create_key_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_create_key_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).parent_fd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_create_key_args),
            "::",
            stringify!(parent_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_create_key_args),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).path_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_create_key_args),
            "::",
            stringify!(path_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).desired_access) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_create_key_args),
            "::",
            stringify!(desired_access)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_create_key_args),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_ptr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_create_key_args),
            "::",
            stringify!(layer_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).txn_fd) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_create_key_args),
            "::",
            stringify!(txn_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad1) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_create_key_args),
            "::",
            stringify!(_pad1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).disposition_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_create_key_args),
            "::",
            stringify!(disposition_ptr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_query_value_args {
    pub name_len: __u32,
    pub _pad0: __u32,
    pub name_ptr: __u64,
    pub type_: __u32,
    pub data_len: __u32,
    pub txn_fd: __s32,
    pub layer_buf_len: __u32,
    pub data_ptr: __u64,
    pub sequence: __u64,
    pub layer_len: __u32,
    pub _pad1: __u32,
    pub layer_ptr: __u64,
}
#[test]
fn bindgen_test_layout_reg_query_value_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_query_value_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_query_value_args>(),
        64usize,
        concat!("Size of: ", stringify!(reg_query_value_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_query_value_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_query_value_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_value_args),
            "::",
            stringify!(name_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_value_args),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_value_args),
            "::",
            stringify!(name_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_value_args),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_len) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_value_args),
            "::",
            stringify!(data_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).txn_fd) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_value_args),
            "::",
            stringify!(txn_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_buf_len) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_value_args),
            "::",
            stringify!(layer_buf_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_ptr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_value_args),
            "::",
            stringify!(data_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sequence) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_value_args),
            "::",
            stringify!(sequence)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_len) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_value_args),
            "::",
            stringify!(layer_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad1) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_value_args),
            "::",
            stringify!(_pad1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_ptr) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_value_args),
            "::",
            stringify!(layer_ptr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_set_value_args {
    pub name_len: __u32,
    pub _pad0: __u32,
    pub name_ptr: __u64,
    pub type_: __u32,
    pub data_len: __u32,
    pub data_ptr: __u64,
    pub layer_len: __u32,
    pub _pad1: __u32,
    pub layer_ptr: __u64,
    pub txn_fd: __s32,
    pub _pad2: __u32,
    pub expected_seq: __u64,
}
#[test]
fn bindgen_test_layout_reg_set_value_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_set_value_args> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_set_value_args>(),
        64usize,
        concat!("Size of: ", stringify!(reg_set_value_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_set_value_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_set_value_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_value_args),
            "::",
            stringify!(name_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_value_args),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_value_args),
            "::",
            stringify!(name_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_value_args),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_len) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_value_args),
            "::",
            stringify!(data_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_ptr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_value_args),
            "::",
            stringify!(data_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_len) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_value_args),
            "::",
            stringify!(layer_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad1) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_value_args),
            "::",
            stringify!(_pad1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_value_args),
            "::",
            stringify!(layer_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).txn_fd) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_value_args),
            "::",
            stringify!(txn_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad2) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_value_args),
            "::",
            stringify!(_pad2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).expected_seq) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_value_args),
            "::",
            stringify!(expected_seq)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_delete_value_args {
    pub name_len: __u32,
    pub _pad0: __u32,
    pub name_ptr: __u64,
    pub layer_len: __u32,
    pub _pad1: __u32,
    pub layer_ptr: __u64,
    pub txn_fd: __s32,
    pub _pad2: __u32,
}
#[test]
fn bindgen_test_layout_reg_delete_value_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_delete_value_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_delete_value_args>(),
        40usize,
        concat!("Size of: ", stringify!(reg_delete_value_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_delete_value_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_delete_value_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_value_args),
            "::",
            stringify!(name_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_value_args),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_value_args),
            "::",
            stringify!(name_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_value_args),
            "::",
            stringify!(layer_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad1) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_value_args),
            "::",
            stringify!(_pad1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_ptr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_value_args),
            "::",
            stringify!(layer_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).txn_fd) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_value_args),
            "::",
            stringify!(txn_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad2) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_value_args),
            "::",
            stringify!(_pad2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_blanket_tombstone_args {
    pub layer_len: __u32,
    pub _pad0: __u32,
    pub layer_ptr: __u64,
    pub set: __u8,
    pub _pad1: [__u8; 3usize],
    pub txn_fd: __s32,
}
#[test]
fn bindgen_test_layout_reg_blanket_tombstone_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_blanket_tombstone_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_blanket_tombstone_args>(),
        24usize,
        concat!("Size of: ", stringify!(reg_blanket_tombstone_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_blanket_tombstone_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_blanket_tombstone_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_blanket_tombstone_args),
            "::",
            stringify!(layer_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_blanket_tombstone_args),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_blanket_tombstone_args),
            "::",
            stringify!(layer_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).set) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_blanket_tombstone_args),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad1) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_blanket_tombstone_args),
            "::",
            stringify!(_pad1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).txn_fd) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_blanket_tombstone_args),
            "::",
            stringify!(txn_fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_query_values_batch_args {
    pub buf_len: __u32,
    pub count: __u32,
    pub buf_ptr: __u64,
    pub txn_fd: __s32,
    pub _pad: __u32,
}
#[test]
fn bindgen_test_layout_reg_query_values_batch_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_query_values_batch_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_query_values_batch_args>(),
        24usize,
        concat!("Size of: ", stringify!(reg_query_values_batch_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_query_values_batch_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_query_values_batch_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buf_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_values_batch_args),
            "::",
            stringify!(buf_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_values_batch_args),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).buf_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_values_batch_args),
            "::",
            stringify!(buf_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).txn_fd) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_values_batch_args),
            "::",
            stringify!(txn_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_values_batch_args),
            "::",
            stringify!(_pad)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_enum_value_args {
    pub index: __u32,
    pub name_len: __u32,
    pub name_ptr: __u64,
    pub type_: __u32,
    pub data_len: __u32,
    pub data_ptr: __u64,
    pub txn_fd: __s32,
    pub _pad: __u32,
}
#[test]
fn bindgen_test_layout_reg_enum_value_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_enum_value_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_enum_value_args>(),
        40usize,
        concat!("Size of: ", stringify!(reg_enum_value_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_enum_value_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_enum_value_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_value_args),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_value_args),
            "::",
            stringify!(name_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_value_args),
            "::",
            stringify!(name_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_value_args),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_len) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_value_args),
            "::",
            stringify!(data_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_ptr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_value_args),
            "::",
            stringify!(data_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).txn_fd) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_value_args),
            "::",
            stringify!(txn_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_value_args),
            "::",
            stringify!(_pad)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_enum_subkey_args {
    pub index: __u32,
    pub name_len: __u32,
    pub name_ptr: __u64,
    pub last_write_time: __u64,
    pub subkey_count: __u32,
    pub value_count: __u32,
    pub txn_fd: __s32,
    pub _pad: __u32,
}
#[test]
fn bindgen_test_layout_reg_enum_subkey_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_enum_subkey_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_enum_subkey_args>(),
        40usize,
        concat!("Size of: ", stringify!(reg_enum_subkey_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_enum_subkey_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_enum_subkey_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_subkey_args),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_subkey_args),
            "::",
            stringify!(name_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_subkey_args),
            "::",
            stringify!(name_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).last_write_time) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_subkey_args),
            "::",
            stringify!(last_write_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).subkey_count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_subkey_args),
            "::",
            stringify!(subkey_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_count) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_subkey_args),
            "::",
            stringify!(value_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).txn_fd) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_subkey_args),
            "::",
            stringify!(txn_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_enum_subkey_args),
            "::",
            stringify!(_pad)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_query_key_info_args {
    pub name_len: __u32,
    pub _pad0: __u32,
    pub name_ptr: __u64,
    pub last_write_time: __u64,
    pub subkey_count: __u32,
    pub value_count: __u32,
    pub max_subkey_name_len: __u32,
    pub max_value_name_len: __u32,
    pub max_value_data_size: __u32,
    pub sd_size: __u32,
    pub volatile_key: __u8,
    pub symlink: __u8,
    pub _pad1: [__u8; 6usize],
    pub hive_generation: __u64,
}
#[test]
fn bindgen_test_layout_reg_query_key_info_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_query_key_info_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_query_key_info_args>(),
        64usize,
        concat!("Size of: ", stringify!(reg_query_key_info_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_query_key_info_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_query_key_info_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(name_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(name_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).last_write_time) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(last_write_time)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).subkey_count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(subkey_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_count) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(value_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_subkey_name_len) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(max_subkey_name_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_value_name_len) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(max_value_name_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_value_data_size) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(max_value_data_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sd_size) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(sd_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).volatile_key) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(volatile_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).symlink) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(symlink)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad1) as usize - ptr as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(_pad1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hive_generation) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_query_key_info_args),
            "::",
            stringify!(hive_generation)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_delete_key_args {
    pub layer_len: __u32,
    pub _pad0: __u32,
    pub layer_ptr: __u64,
    pub txn_fd: __s32,
    pub _pad1: __u32,
}
#[test]
fn bindgen_test_layout_reg_delete_key_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_delete_key_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_delete_key_args>(),
        24usize,
        concat!("Size of: ", stringify!(reg_delete_key_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_delete_key_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_delete_key_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_key_args),
            "::",
            stringify!(layer_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_key_args),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_key_args),
            "::",
            stringify!(layer_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).txn_fd) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_key_args),
            "::",
            stringify!(txn_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad1) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_delete_key_args),
            "::",
            stringify!(_pad1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_hide_key_args {
    pub layer_len: __u32,
    pub _pad0: __u32,
    pub layer_ptr: __u64,
    pub txn_fd: __s32,
    pub _pad1: __u32,
}
#[test]
fn bindgen_test_layout_reg_hide_key_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_hide_key_args> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_hide_key_args>(),
        24usize,
        concat!("Size of: ", stringify!(reg_hide_key_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_hide_key_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_hide_key_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_hide_key_args),
            "::",
            stringify!(layer_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_hide_key_args),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).layer_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_hide_key_args),
            "::",
            stringify!(layer_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).txn_fd) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_hide_key_args),
            "::",
            stringify!(txn_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad1) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_hide_key_args),
            "::",
            stringify!(_pad1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_get_security_args {
    pub security_info: __u32,
    pub sd_len: __u32,
    pub sd_ptr: __u64,
}
#[test]
fn bindgen_test_layout_reg_get_security_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_get_security_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_get_security_args>(),
        16usize,
        concat!("Size of: ", stringify!(reg_get_security_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_get_security_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_get_security_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).security_info) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_get_security_args),
            "::",
            stringify!(security_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sd_len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_get_security_args),
            "::",
            stringify!(sd_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sd_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_get_security_args),
            "::",
            stringify!(sd_ptr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_set_security_args {
    pub security_info: __u32,
    pub sd_len: __u32,
    pub sd_ptr: __u64,
    pub txn_fd: __s32,
    pub _pad: __u32,
}
#[test]
fn bindgen_test_layout_reg_set_security_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_set_security_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_set_security_args>(),
        24usize,
        concat!("Size of: ", stringify!(reg_set_security_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_set_security_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_set_security_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).security_info) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_security_args),
            "::",
            stringify!(security_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sd_len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_security_args),
            "::",
            stringify!(sd_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sd_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_security_args),
            "::",
            stringify!(sd_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).txn_fd) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_security_args),
            "::",
            stringify!(txn_fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_set_security_args),
            "::",
            stringify!(_pad)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_notify_args {
    pub filter: __u32,
    pub subtree: __u8,
    pub _pad: [__u8; 3usize],
}
#[test]
fn bindgen_test_layout_reg_notify_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_notify_args> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_notify_args>(),
        8usize,
        concat!("Size of: ", stringify!(reg_notify_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_notify_args>(),
        4usize,
        concat!("Alignment of ", stringify!(reg_notify_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).filter) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_notify_args),
            "::",
            stringify!(filter)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).subtree) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_notify_args),
            "::",
            stringify!(subtree)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_notify_args),
            "::",
            stringify!(_pad)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_backup_args {
    pub output_fd: __s32,
}
#[test]
fn bindgen_test_layout_reg_backup_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_backup_args> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_backup_args>(),
        4usize,
        concat!("Size of: ", stringify!(reg_backup_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_backup_args>(),
        4usize,
        concat!("Alignment of ", stringify!(reg_backup_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).output_fd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_backup_args),
            "::",
            stringify!(output_fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_restore_args {
    pub input_fd: __s32,
}
#[test]
fn bindgen_test_layout_reg_restore_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_restore_args> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_restore_args>(),
        4usize,
        concat!("Size of: ", stringify!(reg_restore_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_restore_args>(),
        4usize,
        concat!("Alignment of ", stringify!(reg_restore_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).input_fd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_restore_args),
            "::",
            stringify!(input_fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_txn_status_args {
    pub state: __u32,
    pub terminal_errno: __s32,
}
#[test]
fn bindgen_test_layout_reg_txn_status_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_txn_status_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_txn_status_args>(),
        8usize,
        concat!("Size of: ", stringify!(reg_txn_status_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_txn_status_args>(),
        4usize,
        concat!("Alignment of ", stringify!(reg_txn_status_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_txn_status_args),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).terminal_errno) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_txn_status_args),
            "::",
            stringify!(terminal_errno)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_src_register_args {
    pub hive_count: __u32,
    pub _pad: __u32,
    pub max_sequence: __u64,
    pub hives_ptr: __u64,
}
#[test]
fn bindgen_test_layout_reg_src_register_args() {
    const UNINIT: ::core::mem::MaybeUninit<reg_src_register_args> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_src_register_args>(),
        24usize,
        concat!("Size of: ", stringify!(reg_src_register_args))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_src_register_args>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_src_register_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hive_count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_src_register_args),
            "::",
            stringify!(hive_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_src_register_args),
            "::",
            stringify!(_pad)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_sequence) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_src_register_args),
            "::",
            stringify!(max_sequence)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hives_ptr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_src_register_args),
            "::",
            stringify!(hives_ptr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct reg_src_hive_entry {
    pub name_len: __u32,
    pub _pad0: __u32,
    pub name_ptr: __u64,
    pub root_guid: [__u8; 16usize],
    pub flags: __u32,
    pub _pad1: __u32,
    pub scope_guid: [__u8; 16usize],
}
#[test]
fn bindgen_test_layout_reg_src_hive_entry() {
    const UNINIT: ::core::mem::MaybeUninit<reg_src_hive_entry> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<reg_src_hive_entry>(),
        56usize,
        concat!("Size of: ", stringify!(reg_src_hive_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<reg_src_hive_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_src_hive_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_src_hive_entry),
            "::",
            stringify!(name_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_src_hive_entry),
            "::",
            stringify!(_pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_src_hive_entry),
            "::",
            stringify!(name_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).root_guid) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_src_hive_entry),
            "::",
            stringify!(root_guid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_src_hive_entry),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._pad1) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_src_hive_entry),
            "::",
            stringify!(_pad1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scope_guid) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_src_hive_entry),
            "::",
            stringify!(scope_guid)
        )
    );
}
